// Generated by jextract

package org.cryptomator.jfuse.win.amd64.extr;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;

import jdk.incubator.foreign.*;

public class fuse_operations {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("getattr"),
        Constants$root.C_POINTER$LAYOUT.withName("getdir"),
        Constants$root.C_POINTER$LAYOUT.withName("readlink"),
        Constants$root.C_POINTER$LAYOUT.withName("mknod"),
        Constants$root.C_POINTER$LAYOUT.withName("mkdir"),
        Constants$root.C_POINTER$LAYOUT.withName("unlink"),
        Constants$root.C_POINTER$LAYOUT.withName("rmdir"),
        Constants$root.C_POINTER$LAYOUT.withName("symlink"),
        Constants$root.C_POINTER$LAYOUT.withName("rename"),
        Constants$root.C_POINTER$LAYOUT.withName("link"),
        Constants$root.C_POINTER$LAYOUT.withName("chmod"),
        Constants$root.C_POINTER$LAYOUT.withName("chown"),
        Constants$root.C_POINTER$LAYOUT.withName("truncate"),
        Constants$root.C_POINTER$LAYOUT.withName("utime"),
        Constants$root.C_POINTER$LAYOUT.withName("open"),
        Constants$root.C_POINTER$LAYOUT.withName("read"),
        Constants$root.C_POINTER$LAYOUT.withName("write"),
        Constants$root.C_POINTER$LAYOUT.withName("statfs"),
        Constants$root.C_POINTER$LAYOUT.withName("flush"),
        Constants$root.C_POINTER$LAYOUT.withName("release"),
        Constants$root.C_POINTER$LAYOUT.withName("fsync"),
        Constants$root.C_POINTER$LAYOUT.withName("setxattr"),
        Constants$root.C_POINTER$LAYOUT.withName("getxattr"),
        Constants$root.C_POINTER$LAYOUT.withName("listxattr"),
        Constants$root.C_POINTER$LAYOUT.withName("removexattr"),
        Constants$root.C_POINTER$LAYOUT.withName("opendir"),
        Constants$root.C_POINTER$LAYOUT.withName("readdir"),
        Constants$root.C_POINTER$LAYOUT.withName("releasedir"),
        Constants$root.C_POINTER$LAYOUT.withName("fsyncdir"),
        Constants$root.C_POINTER$LAYOUT.withName("init"),
        Constants$root.C_POINTER$LAYOUT.withName("destroy"),
        Constants$root.C_POINTER$LAYOUT.withName("access"),
        Constants$root.C_POINTER$LAYOUT.withName("create"),
        Constants$root.C_POINTER$LAYOUT.withName("ftruncate"),
        Constants$root.C_POINTER$LAYOUT.withName("fgetattr"),
        Constants$root.C_POINTER$LAYOUT.withName("lock"),
        Constants$root.C_POINTER$LAYOUT.withName("utimens"),
        Constants$root.C_POINTER$LAYOUT.withName("bmap"),
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(1).withName("flag_nullpath_ok"),
            MemoryLayout.paddingLayout(1).withName("flag_nopath"),
            MemoryLayout.paddingLayout(1).withName("flag_utime_omit_ok"),
            MemoryLayout.paddingLayout(29).withName("flag_reserved"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_POINTER$LAYOUT.withName("ioctl"),
        Constants$root.C_POINTER$LAYOUT.withName("poll"),
        Constants$root.C_POINTER$LAYOUT.withName("write_buf"),
        Constants$root.C_POINTER$LAYOUT.withName("read_buf"),
        Constants$root.C_POINTER$LAYOUT.withName("flock"),
        Constants$root.C_POINTER$LAYOUT.withName("fallocate"),
        Constants$root.C_POINTER$LAYOUT.withName("reserved00"),
        Constants$root.C_POINTER$LAYOUT.withName("reserved01"),
        Constants$root.C_POINTER$LAYOUT.withName("reserved02"),
        Constants$root.C_POINTER$LAYOUT.withName("statfs_x"),
        Constants$root.C_POINTER$LAYOUT.withName("setvolname"),
        Constants$root.C_POINTER$LAYOUT.withName("exchange"),
        Constants$root.C_POINTER$LAYOUT.withName("getxtimes"),
        Constants$root.C_POINTER$LAYOUT.withName("setbkuptime"),
        Constants$root.C_POINTER$LAYOUT.withName("setchgtime"),
